/* Script Execution error in Action * Title * */
"ACTION_EXECUTION_ERROR_ALERT" = "Cannot execute the “%@” Action.";

/* Script Execution error in Action * Msg * */
"ACTION_EXECUTION_ERROR_ALERT_MSG" = "An error occured during execution of the Apple Script:\n %@";

/* Trying to create Script File Action without file * Title * */
"CREATE_ACTION_WITHOUT_FILE" = "You cannot create a Script File Action without File.";

/* Trying to create Script File Action without file * Msg * */
"CREATE_ACTION_WITHOUT_FILE_MSG" = "To create a new Script File Action, you must first select a Compiled Script File, or if you want create a Simple Script Action, clic on the Source Tab.";

/* Empty Source Error * Title * */
"CREATE_ACTION_WITHOUT_SOURCE_ALERT" = "You cannot create an Applescript with no source.";

/* Empty Source Error * Msg * */
"CREATE_ACTION_WITHOUT_SOURCE_ALERT_MSG" = "You must type a script before trying to compile, or choose the “File” tab if you want to execute a compiled Script.";

/* File Script Action Description (%@ => File name) */
"DESC_EXECUTE_FILE" = "Execute “%@”";

/* Simple Script Action Description */
"DESC_EXECUTE_SOURCE" = "Execute an AppleScript";

/* Import uncompiled Script Error * Title * */
"INVALID_SCRIPT_FILE_ALERT" = "The compiled script cannot be opened because an error occured.";

/* Import uncompiled Script Error * Msg * */
"INVALID_SCRIPT_FILE_ALERT_MSG" = "The file “%@” isn't a valid compiled script. Choose an other file, or if it is a Script, compile it first with “Script Editor”.";

/* Alert default button */
"OK" = "OK";

/* Unknow Error in -initWithSource * Title * */
"SCRIPT_CREATION_ERROR_ALERT" = "An error prevented from creating the script.";

/* Unknow Error in -initWithSource * Msg * */
"SCRIPT_CREATION_ERROR_ALERT_MSG" = "An unknow error prevented Spark from creating the script. Check if script source is valid and try again.";

/* Syntax Error * Title * */
"SYNTAX_ERROR_ALERT" = "Syntax Error in the Script Source.";

